Revit 2027 API
IFCLegacyStairOrRamp Class
 The class contains the components of a legacy stair or ramp.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCLegacyStairOrRamp : IDisposable
Public Class IFCLegacyStairOrRamp
	Implements IDisposable
public ref class IFCLegacyStairOrRamp : IDisposable
type IFCLegacyStairOrRamp =
    class
        interface IDisposable
    end
The IFCLegacyStairOrRamp type exposes the following members.
Properties
Name | Description
IsRamp |  True if it is a ramp, false if it is a stair.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RiserHeight |  The height of riser.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCLegacyStairOrRamp
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundaryLines |  Gets boundary lines.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLandingGeometries |  Gets the geometries of landings.
GetNumberOfRisers |  Gets the number of risers.
GetNumberOfTreads |  Gets the number of treads.
GetRunGeometries |  Gets the geometries of runs.
GetStringerGeometries |  Gets the geometries of stringers.
GetTreadsLength |  Gets the length of treads.
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWalkLines |  Gets walk lines.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace